QQQuer/GD32H7-Openvela/board/contest_board/nuttx/arch/arm/src/gd32h7xx/hardware/gd32h759_pinmap.h
/* TIMER7 - Additional ports */
#define GPIO_TIMER7_CH0_1      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_C|GPIO_CFG_PIN_6)
#define GPIO_TIMER7_CH1_1      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_C|GPIO_CFG_PIN_7)
#define GPIO_TIMER7_CH2_1      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_C|GPIO_CFG_PIN_8)
#define GPIO_TIMER7_CH3_1      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_C|GPIO_CFG_PIN_9)
#define GPIO_TIMER7_MCH3_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_C|GPIO_CFG_PIN_9)
#define GPIO_TIMER7_CH2_2      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_2|GPIO_CFG_PORT_D|GPIO_CFG_PIN_0)
#define GPIO_TIMER7_MCH3_2     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_D|GPIO_CFG_PIN_4)
#define GPIO_TIMER7_CH3_2      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_D|GPIO_CFG_PIN_5)
#define GPIO_TIMER7_MCH3_3     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_D|GPIO_CFG_PIN_11)
#define GPIO_TIMER7_BRKIN0_2   (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_G|GPIO_CFG_PIN_2)
#define GPIO_TIMER7_BRKIN2_3   (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_G|GPIO_CFG_PIN_3)
#define GPIO_TIMER7_BRKIN1_2   (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_G|GPIO_CFG_PIN_4)
#define GPIO_TIMER7_ETI_2      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_G|GPIO_CFG_PIN_8)
#define GPIO_TIMER7_BRKIN1_3   (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_G|GPIO_CFG_PIN_9)
#define GPIO_TIMER7_MCH0_3     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_H|GPIO_CFG_PIN_13)
#define GPIO_TIMER7_MCH1_2     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_H|GPIO_CFG_PIN_14)
#define GPIO_TIMER7_MCH2_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_H|GPIO_CFG_PIN_15)
#define GPIO_TIMER7_MCH2_2     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_1|GPIO_CFG_PORT_J|GPIO_CFG_PIN_8)
#define GPIO_TIMER7_CH0_2      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_J|GPIO_CFG_PIN_8)
#define GPIO_TIMER7_MCH0_4     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_J|GPIO_CFG_PIN_9)
#define GPIO_TIMER7_CH1_2      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_J|GPIO_CFG_PIN_10)
#define GPIO_TIMER7_MCH1_3     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_J|GPIO_CFG_PIN_11)
#define GPIO_TIMER7_CH2_3      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_K|GPIO_CFG_PIN_0)
#define GPIO_TIMER7_MCH2_3     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_K|GPIO_CFG_PIN_1)
#define GPIO_TIMER7_BRKIN0_3   (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_3|GPIO_CFG_PORT_K|GPIO_CFG_PIN_2)

/* TIMER14 - Additional ports */
#define GPIO_TIMER14_BRKIN0_2  (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_4|GPIO_CFG_PORT_D|GPIO_CFG_PIN_2)
#define GPIO_TIMER14_MCH0_2    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_4|GPIO_CFG_PORT_E|GPIO_CFG_PIN_4)
#define GPIO_TIMER14_CH0_2     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_4|GPIO_CFG_PORT_E|GPIO_CFG_PIN_5)
#define GPIO_TIMER14_CH1_2     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_4|GPIO_CFG_PORT_E|GPIO_CFG_PIN_6)
#define GPIO_TIMER14_CH0_3     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_4|GPIO_CFG_PORT_C|GPIO_CFG_PIN_12)
#define GPIO_TIMER14_BRKIN0_3  (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_4|GPIO_CFG_PORT_E|GPIO_CFG_PIN_3)

/* TIMER15/16/22/23 */
#define GPIO_TIMER15_BRKIN0_1  (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_1|GPIO_CFG_PORT_B|GPIO_CFG_PIN_4)
#define GPIO_TIMER15_MCH0_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_1|GPIO_CFG_PORT_B|GPIO_CFG_PIN_13)
#define GPIO_TIMER15_CH0_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_1|GPIO_CFG_PORT_B|GPIO_CFG_PIN_8)
#define GPIO_TIMER15_MCH0_2    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_1|GPIO_CFG_PORT_F|GPIO_CFG_PIN_8)
#define GPIO_TIMER15_CH0_2     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_1|GPIO_CFG_PORT_F|GPIO_CFG_PIN_6)
#define GPIO_TIMER15_BRKIN0_2  (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_1|GPIO_CFG_PORT_F|GPIO_CFG_PIN_10)
#define GPIO_TIMER16_BRKIN0_1  (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_1|GPIO_CFG_PORT_B|GPIO_CFG_PIN_5)
#define GPIO_TIMER16_MCH0_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_1|GPIO_CFG_PORT_B|GPIO_CFG_PIN_14)
#define GPIO_TIMER16_CH0_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_1|GPIO_CFG_PORT_B|GPIO_CFG_PIN_9)
#define GPIO_TIMER16_BRKIN0_2  (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_1|GPIO_CFG_PORT_G|GPIO_CFG_PIN_6)
#define GPIO_TIMER16_MCH0_2    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_1|GPIO_CFG_PORT_F|GPIO_CFG_PIN_9)
#define GPIO_TIMER16_CH0_2     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_1|GPIO_CFG_PORT_F|GPIO_CFG_PIN_7)
#define GPIO_TIMER22_ETI_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_2)
#define GPIO_TIMER22_CH0_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_F|GPIO_CFG_PIN_0)
#define GPIO_TIMER22_CH1_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_F|GPIO_CFG_PIN_1)
#define GPIO_TIMER22_CH2_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_F|GPIO_CFG_PIN_2)
#define GPIO_TIMER22_CH3_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_F|GPIO_CFG_PIN_3)
#define GPIO_TIMER22_CH0_2     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_F|GPIO_CFG_PIN_6)
#define GPIO_TIMER22_CH1_2     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_F|GPIO_CFG_PIN_7)
#define GPIO_TIMER22_CH2_2     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_F|GPIO_CFG_PIN_8)
#define GPIO_TIMER22_CH3_2     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_F|GPIO_CFG_PIN_9)
#define GPIO_TIMER22_ETI_2     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_G|GPIO_CFG_PIN_3)
#define GPIO_TIMER22_CH0_3     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_G|GPIO_CFG_PIN_12)
#define GPIO_TIMER22_CH1_3     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_G|GPIO_CFG_PIN_13)
#define GPIO_TIMER22_CH2_3     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_G|GPIO_CFG_PIN_14)
#define GPIO_TIMER23_ETI_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_B|GPIO_CFG_PIN_3)
#define GPIO_TIMER23_ETI_2     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_G|GPIO_CFG_PIN_2)
#define GPIO_TIMER23_CH0_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_F|GPIO_CFG_PIN_11)
#define GPIO_TIMER23_CH1_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_F|GPIO_CFG_PIN_12)
#define GPIO_TIMER23_CH2_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_F|GPIO_CFG_PIN_13)
#define GPIO_TIMER23_CH3_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_F|GPIO_CFG_PIN_14)

