QQQuer/GD32H7-Openvela/board/contest_board/nuttx/arch/arm/src/gd32h7xx/hardware/gd32h759_pinmap.h
/* UART4 */
#define GPIO_UART4_RX_1        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_B|GPIO_CFG_PIN_5)
#define GPIO_UART4_TX_1        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_B|GPIO_CFG_PIN_6)
#define GPIO_UART4_RX_2        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_C|GPIO_CFG_PIN_8)
#define GPIO_UART4_CTS_1       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_C|GPIO_CFG_PIN_9)
#define GPIO_UART4_TX_2        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_C|GPIO_CFG_PIN_12)
#define GPIO_UART4_RX_3        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_D|GPIO_CFG_PIN_2)
#define GPIO_UART4_RTS_DE_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_C|GPIO_CFG_PIN_8)
#define GPIO_UART4_RX_4        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_B|GPIO_CFG_PIN_12)
#define GPIO_UART4_TX_3        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_B|GPIO_CFG_PIN_13)

/* USART5 */
#define GPIO_USART5_TX_1       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_7|GPIO_CFG_PORT_C|GPIO_CFG_PIN_6)
#define GPIO_USART5_RX_1       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_7|GPIO_CFG_PORT_C|GPIO_CFG_PIN_7)
#define GPIO_USART5_CK_1       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_7|GPIO_CFG_PORT_C|GPIO_CFG_PIN_8)
#define GPIO_USART5_RTS_DE_1   (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_7|GPIO_CFG_PORT_G|GPIO_CFG_PIN_8)
#define GPIO_USART5_RX_2       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_7|GPIO_CFG_PORT_G|GPIO_CFG_PIN_9)
#define GPIO_USART5_CTS_1      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_7|GPIO_CFG_PORT_G|GPIO_CFG_PIN_12)
#define GPIO_USART5_TX_2       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_7|GPIO_CFG_PORT_G|GPIO_CFG_PIN_14)
#define GPIO_USART5_CTS_2      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_7|GPIO_CFG_PORT_G|GPIO_CFG_PIN_15)
#define GPIO_USART5_RTS_DE_2   (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_7|GPIO_CFG_PORT_G|GPIO_CFG_PIN_8)
#define GPIO_USART5_TX_3       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_7|GPIO_CFG_PORT_G|GPIO_CFG_PIN_13)

/* UART6 */
#define GPIO_UART6_RX_1        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_A|GPIO_CFG_PIN_8)
#define GPIO_UART6_TX_1        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_A|GPIO_CFG_PIN_15)
#define GPIO_UART6_RX_2        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_B|GPIO_CFG_PIN_3)
#define GPIO_UART6_TX_2        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_B|GPIO_CFG_PIN_4)
#define GPIO_UART6_RX_3        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_E|GPIO_CFG_PIN_7)
#define GPIO_UART6_TX_3        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_E|GPIO_CFG_PIN_8)
#define GPIO_UART6_RX_4        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_F|GPIO_CFG_PIN_6)
#define GPIO_UART6_TX_4        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_F|GPIO_CFG_PIN_7)
#define GPIO_UART6_RTS_DE_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_E|GPIO_CFG_PIN_9)
#define GPIO_UART6_CTS_1       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_E|GPIO_CFG_PIN_10)
#define GPIO_UART6_RTS_DE_2    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_F|GPIO_CFG_PIN_8)
#define GPIO_UART6_CTS_2       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_F|GPIO_CFG_PIN_9)

/* UART7 */
#define GPIO_UART7_RX_1        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_E|GPIO_CFG_PIN_0)
#define GPIO_UART7_TX_1        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_E|GPIO_CFG_PIN_1)
#define GPIO_UART7_CTS_1       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_D|GPIO_CFG_PIN_14)
#define GPIO_UART7_RTS_DE_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_D|GPIO_CFG_PIN_15)
#define GPIO_UART7_TX_2        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_J|GPIO_CFG_PIN_8)
#define GPIO_UART7_RX_2        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_J|GPIO_CFG_PIN_9)

/* ------------------------------ CAN ---------------------------- */

/* CAN0 */
#define GPIO_CAN0_RX_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_A|GPIO_CFG_PIN_13)
#define GPIO_CAN0_TX_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_A|GPIO_CFG_PIN_14)
#define GPIO_CAN0_RX_2         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_B|GPIO_CFG_PIN_8)
#define GPIO_CAN0_TX_2         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_B|GPIO_CFG_PIN_9)
#define GPIO_CAN0_RX_3         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_D|GPIO_CFG_PIN_0)
#define GPIO_CAN0_TX_3         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_D|GPIO_CFG_PIN_1)
#define GPIO_CAN0_TX_4         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_H|GPIO_CFG_PIN_13)
#define GPIO_CAN0_RX_4         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_H|GPIO_CFG_PIN_14)

/* CAN1 */
#define GPIO_CAN1_RX_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_B|GPIO_CFG_PIN_5)
#define GPIO_CAN1_TX_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_B|GPIO_CFG_PIN_6)
#define GPIO_CAN1_RX_2         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_B|GPIO_CFG_PIN_12)
#define GPIO_CAN1_TX_2         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_B|GPIO_CFG_PIN_13)

/* CAN2 */
#define GPIO_CAN2_RX_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_5|GPIO_CFG_PORT_D|GPIO_CFG_PIN_12)
#define GPIO_CAN2_TX_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_5|GPIO_CFG_PORT_D|GPIO_CFG_PIN_13)
#define GPIO_CAN2_RX_2         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_2|GPIO_CFG_PORT_F|GPIO_CFG_PIN_6)
#define GPIO_CAN2_TX_2         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_2|GPIO_CFG_PORT_F|GPIO_CFG_PIN_7)
#define GPIO_CAN2_TX_3         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_2|GPIO_CFG_PORT_G|GPIO_CFG_PIN_9)
#define GPIO_CAN2_RX_3         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_2|GPIO_CFG_PORT_G|GPIO_CFG_PIN_10)

/* ------------------------------ SDIO / USBHS ---------------------------- */
#define GPIO_SDIO1_CMD_1       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_USBHS0_ULPI_CK_1  (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_10|GPIO_CFG_PORT_A|GPIO_CFG_PIN_5)
#define GPIO_USBHS0_ULPI_D0_1  (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_10|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)
#define GPIO_USBHS0_ID_1       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_OD|GPIO_CFG_AF_10|GPIO_CFG_PORT_A|GPIO_CFG_PIN_10)
#define GPIO_USBHS0_SOF_1      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_10|GPIO_CFG_PORT_A|GPIO_CFG_PIN_8)

/* ------------------------------ ENET (MAC) ------------------------------ */
#define GPIO_ENET_MII_CRS_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_ENET_MII_RX_CLK_1 (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_A|GPIO_CFG_PIN_1)
#define GPIO_ENET_MDIO_1       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_ENET_MII_COL_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)
#define GPIO_ENET_MII_RX_DV_1  (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_A|GPIO_CFG_PIN_7)
#define GPIO_ENET_RMII_REF_CLK_1 (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_A|GPIO_CFG_PIN_1)

/* ------------------------------ EXMC ------------------------------------ */
#define GPIO_EXMC_A19_1        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_12|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_EXMC_D8_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_12|GPIO_CFG_PORT_A|GPIO_CFG_PIN_4)
#define GPIO_EXMC_D9_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_12|GPIO_CFG_PORT_A|GPIO_CFG_PIN_5)
#define GPIO_EXMC_SDNWE_1      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_12|GPIO_CFG_PORT_A|GPIO_CFG_PIN_7)
#define GPIO_EXMC_INT_1        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_PULLUP|GPIO_CFG_PP|GPIO_CFG_AF_12|GPIO_CFG_PORT_A|GPIO_CFG_PIN_13)

