QQQuer/GD32H7-Openvela/board/contest_board/nuttx/arch/arm/src/gd32h7xx/hardware/gd32h759_pinmap.h
/* ------------------------------ OSPIM ----------------------------------- */
#define GPIO_OSPIM_P0_IO6_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_6|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_OSPIM_P0_IO3_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_A|GPIO_CFG_PIN_1)
#define GPIO_OSPIM_P0_IO0_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_6|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_OSPIM_P0_IO2_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_10|GPIO_CFG_PORT_A|GPIO_CFG_PIN_7)
#define GPIO_OSPIM_P0_SCK_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_12|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)
#define GPIO_OSPIM_P0_CSN_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_B|GPIO_CFG_PIN_10)
#define GPIO_OSPIM_P0_IO1_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_4|GPIO_CFG_PORT_B|GPIO_CFG_PIN_0)

/* ------------------------------ SAI1 ------------------------------------ */
#define GPIO_SAI1_SD1_1        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_10|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_SAI1_MCLK1_1      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_10|GPIO_CFG_PORT_A|GPIO_CFG_PIN_1)
#define GPIO_SAI1_SCK1_1       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_SAI1_FS1_1        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_8|GPIO_CFG_PORT_A|GPIO_CFG_PIN_14)

/* ------------------------------ TLI (LCD) ------------------------------- */
#define GPIO_TLI_R2_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_A|GPIO_CFG_PIN_1)
#define GPIO_TLI_R1_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_TLI_B2_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)
#define GPIO_TLI_R4_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_A|GPIO_CFG_PIN_5)
#define GPIO_TLI_G2_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_A|GPIO_CFG_PIN_6)
#define GPIO_TLI_VSYNC_1       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_A|GPIO_CFG_PIN_4)
#define GPIO_TLI_VSYNC_2       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_A|GPIO_CFG_PIN_7)
#define GPIO_TLI_R6_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_A|GPIO_CFG_PIN_8)
#define GPIO_TLI_R5_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_A|GPIO_CFG_PIN_9)
#define GPIO_TLI_B4_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_12|GPIO_CFG_PORT_A|GPIO_CFG_PIN_10)
#define GPIO_TLI_R4_2          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_A|GPIO_CFG_PIN_13)
#define GPIO_TLI_R5_2          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_A|GPIO_CFG_PIN_14)
#define GPIO_TLI_R3_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_9|GPIO_CFG_PORT_A|GPIO_CFG_PIN_15)
#define GPIO_TLI_B6_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_A|GPIO_CFG_PIN_15)
#define GPIO_TLI_G0_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_B|GPIO_CFG_PIN_1)
#define GPIO_TLI_G1_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_B|GPIO_CFG_PIN_0)
#define GPIO_TLI_B5_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)
#define GPIO_TLI_G4_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_B|GPIO_CFG_PIN_10)
#define GPIO_TLI_G5_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_B|GPIO_CFG_PIN_11)
#define GPIO_TLI_G7_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_4|GPIO_CFG_PORT_A|GPIO_CFG_PIN_14)
#define GPIO_TLI_CLK_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_B|GPIO_CFG_PIN_14)
#define GPIO_TLI_B6_2          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_B|GPIO_CFG_PIN_6)
#define GPIO_TLI_B7_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_B|GPIO_CFG_PIN_9)
#define GPIO_TLI_R6_2          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_B|GPIO_CFG_PIN_6)
#define GPIO_TLI_R5_3          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_14|GPIO_CFG_PORT_B|GPIO_CFG_PIN_5)

/* ------------------------------ DCI (Camera) ---------------------------- */
#define GPIO_DCI_HSYNC_1       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_A|GPIO_CFG_PIN_4)
#define GPIO_DCI_PIXCLK_1      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_A|GPIO_CFG_PIN_6)
#define GPIO_DCI_VSYNC_1       (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_7)
#define GPIO_DCI_D0_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_A|GPIO_CFG_PIN_9)
#define GPIO_DCI_D1_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_A|GPIO_CFG_PIN_10)
#define GPIO_DCI_D2_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_5)
#define GPIO_DCI_D5_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_6)
#define GPIO_DCI_D6_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_8)
#define GPIO_DCI_D7_1          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_9)
#define GPIO_DCI_D10_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_5)
#define GPIO_DCI_D10_2         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_A|GPIO_CFG_PIN_5)
#define GPIO_DCI_D11_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_A|GPIO_CFG_PIN_6)
#define GPIO_DCI_D11_2         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_15)
#define GPIO_DCI_D12_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_4)
#define GPIO_DCI_D13_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_7)
#define GPIO_DCI_D0_2          (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_6)

/* ------------------------------ HPDF ------------------------------------ */
#define GPIO_HPDF_DATAIN1_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_6|GPIO_CFG_PORT_B|GPIO_CFG_PIN_2)
#define GPIO_HPDF_CKIN1_1      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_4|GPIO_CFG_PORT_B|GPIO_CFG_PIN_2)
#define GPIO_HPDF_DATAIN2_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_6|GPIO_CFG_PORT_B|GPIO_CFG_PIN_14)
#define GPIO_HPDF_DATAIN5_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_B|GPIO_CFG_PIN_6)
#define GPIO_HPDF_CKIN5_1      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_B|GPIO_CFG_PIN_7)
#define GPIO_HPDF_DATAIN7_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_6|GPIO_CFG_PORT_B|GPIO_CFG_PIN_10)
#define GPIO_HPDF_CKIN7_1      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_6|GPIO_CFG_PORT_B|GPIO_CFG_PIN_11)
#define GPIO_HPDF_DATAIN7_2    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_6|GPIO_CFG_PORT_B|GPIO_CFG_PIN_10)
#define GPIO_HPDF_CKOUT_1      (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_6|GPIO_CFG_PORT_B|GPIO_CFG_PIN_0)

/* ------------------------------ CMP MUX --------------------------------- */
#define GPIO_CMP_MUX_OUT0_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_10|GPIO_CFG_PORT_A|GPIO_CFG_PIN_6)
#define GPIO_CMP_MUX_OUT1_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_12|GPIO_CFG_PORT_A|GPIO_CFG_PIN_8)
#define GPIO_CMP_MUX_OUT2_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_12)

/* ------------------------------ MDIO Extended --------------------------- */
#define GPIO_MDIO_A0_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_A|GPIO_CFG_PIN_5)
#define GPIO_MDIO_A0_2         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_12|GPIO_CFG_PORT_A|GPIO_CFG_PIN_15)
#define GPIO_MDIO_A1_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_0)
#define GPIO_MDIO_A2_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_1)
#define GPIO_MDIO_A3_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_A|GPIO_CFG_PIN_13)
#define GPIO_MDIO_A4_1         (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_A|GPIO_CFG_PIN_14)
#define GPIO_MDIO_MDC_1        (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_A|GPIO_CFG_PIN_6)
#define GPIO_MDIO_1            (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_11|GPIO_CFG_PORT_A|GPIO_CFG_PIN_10)

