QQQuer/GD32H7-Openvela/board/contest_board/nuttx/arch/arm/src/gd32h7xx/hardware/gd32h759_pinmap.h
/* ------------------------------ TRIGSEL --------------------------------- */
#define GPIO_TRIGSEL_IN0_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_TRIGSEL_IN1_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_A|GPIO_CFG_PIN_1)
#define GPIO_TRIGSEL_IN4_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)
#define GPIO_TRIGSEL_IN5_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_A|GPIO_CFG_PIN_7)
#define GPIO_TRIGSEL_IN7_1     (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_TRIGSEL_IN10_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_A|GPIO_CFG_PIN_13)
#define GPIO_TRIGSEL_IN11_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_A|GPIO_CFG_PIN_14)
#define GPIO_TRIGSEL_OUT0_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_A|GPIO_CFG_PIN_15)
#define GPIO_TRIGSEL_OUT3_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_0)
#define GPIO_TRIGSEL_OUT4_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_1)
#define GPIO_TRIGSEL_OUT1_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_14)
#define GPIO_TRIGSEL_OUT2_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_10)
#define GPIO_TRIGSEL_OUT5_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_15)
#define GPIO_TRIGSEL_OUT6_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_4)
#define GPIO_TRIGSEL_OUT7_1    (GPIO_CFG_MODE_AF|GPIO_CFG_PUPD_NONE|GPIO_CFG_PP|GPIO_CFG_AF_13|GPIO_CFG_PORT_B|GPIO_CFG_PIN_3)

/* ------------------------------ EVENTOUT -------------------------------- */
#define GPIO_EVENTOUT_PA0      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_A|GPIO_CFG_PIN_0)
#define GPIO_EVENTOUT_PA1      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_A|GPIO_CFG_PIN_1)
#define GPIO_EVENTOUT_PA2      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_A|GPIO_CFG_PIN_2)
#define GPIO_EVENTOUT_PA3      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_A|GPIO_CFG_PIN_3)
#define GPIO_EVENTOUT_PA4      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_A|GPIO_CFG_PIN_4)
#define GPIO_EVENTOUT_PA5      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_A|GPIO_CFG_PIN_5)
#define GPIO_EVENTOUT_PA6      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_A|GPIO_CFG_PIN_6)
#define GPIO_EVENTOUT_PA7      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_A|GPIO_CFG_PIN_7)
#define GPIO_EVENTOUT_PA8      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_A|GPIO_CFG_PIN_8)
#define GPIO_EVENTOUT_PA9      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_A|GPIO_CFG_PIN_9)
#define GPIO_EVENTOUT_PA10     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_A|GPIO_CFG_PIN_10)
#define GPIO_EVENTOUT_PA13     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_A|GPIO_CFG_PIN_13)
#define GPIO_EVENTOUT_PA14     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_A|GPIO_CFG_PIN_14)
#define GPIO_EVENTOUT_PA15     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_A|GPIO_CFG_PIN_15)
#define GPIO_EVENTOUT_PB0      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_0)
#define GPIO_EVENTOUT_PB1      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_1)
#define GPIO_EVENTOUT_PB2      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_2)
#define GPIO_EVENTOUT_PB3      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_3)
#define GPIO_EVENTOUT_PB4      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_4)
#define GPIO_EVENTOUT_PB5      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_5)
#define GPIO_EVENTOUT_PB6      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_6)
#define GPIO_EVENTOUT_PB7      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_7)
#define GPIO_EVENTOUT_PB8      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_8)
#define GPIO_EVENTOUT_PB9      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_9)
#define GPIO_EVENTOUT_PB10     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_10)
#define GPIO_EVENTOUT_PB11     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_11)
#define GPIO_EVENTOUT_PB12     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_12)
#define GPIO_EVENTOUT_PB13     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_13)
#define GPIO_EVENTOUT_PB14     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_14)
#define GPIO_EVENTOUT_PB15     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_B|GPIO_CFG_PIN_15)
#define GPIO_EVENTOUT_PC0      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_0)
#define GPIO_EVENTOUT_PC1      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_1)
#define GPIO_EVENTOUT_PC2      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_2)
#define GPIO_EVENTOUT_PC3      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_3)
#define GPIO_EVENTOUT_PC4      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_4)
#define GPIO_EVENTOUT_PC5      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_5)
#define GPIO_EVENTOUT_PC6      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_6)
#define GPIO_EVENTOUT_PC7      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_7)
#define GPIO_EVENTOUT_PC8      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_8)
#define GPIO_EVENTOUT_PC9      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_9)
#define GPIO_EVENTOUT_PC10     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_10)
#define GPIO_EVENTOUT_PC11     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_11)
#define GPIO_EVENTOUT_PC12     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_12)
#define GPIO_EVENTOUT_PC13     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_13)
#define GPIO_EVENTOUT_PC14     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_14)
#define GPIO_EVENTOUT_PC15     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_C|GPIO_CFG_PIN_15)
#define GPIO_EVENTOUT_PD0      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_0)
#define GPIO_EVENTOUT_PD1      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_1)
#define GPIO_EVENTOUT_PD2      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_2)
#define GPIO_EVENTOUT_PD3      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_3)
#define GPIO_EVENTOUT_PD4      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_4)
#define GPIO_EVENTOUT_PD5      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_5)
#define GPIO_EVENTOUT_PD6      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_6)
#define GPIO_EVENTOUT_PD7      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_7)
#define GPIO_EVENTOUT_PD8      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_8)
#define GPIO_EVENTOUT_PD9      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_9)
#define GPIO_EVENTOUT_PD10     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_10)
#define GPIO_EVENTOUT_PD11     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_11)
#define GPIO_EVENTOUT_PD12     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_12)
#define GPIO_EVENTOUT_PD13     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_13)
#define GPIO_EVENTOUT_PD14     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_14)
#define GPIO_EVENTOUT_PD15     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_D|GPIO_CFG_PIN_15)
#define GPIO_EVENTOUT_PE0      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_0)
#define GPIO_EVENTOUT_PE1      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_1)
#define GPIO_EVENTOUT_PE2      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_2)
#define GPIO_EVENTOUT_PE3      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_3)
#define GPIO_EVENTOUT_PE4      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_4)
#define GPIO_EVENTOUT_PE5      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_5)
#define GPIO_EVENTOUT_PE6      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_6)
#define GPIO_EVENTOUT_PE7      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_7)
#define GPIO_EVENTOUT_PE8      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_8)
#define GPIO_EVENTOUT_PE9      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_9)
#define GPIO_EVENTOUT_PE10     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_10)
#define GPIO_EVENTOUT_PE11     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_11)
#define GPIO_EVENTOUT_PE12     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_12)
#define GPIO_EVENTOUT_PE13     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_13)
#define GPIO_EVENTOUT_PE14     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_14)
#define GPIO_EVENTOUT_PE15     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_E|GPIO_CFG_PIN_15)
#define GPIO_EVENTOUT_PF0      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_0)
#define GPIO_EVENTOUT_PF1      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_1)
#define GPIO_EVENTOUT_PF2      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_2)
#define GPIO_EVENTOUT_PF3      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_3)
#define GPIO_EVENTOUT_PF4      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_4)
#define GPIO_EVENTOUT_PF5      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_5)
#define GPIO_EVENTOUT_PF6      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_6)
#define GPIO_EVENTOUT_PF7      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_7)
#define GPIO_EVENTOUT_PF8      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_8)
#define GPIO_EVENTOUT_PF9      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_9)
#define GPIO_EVENTOUT_PF10     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_10)
#define GPIO_EVENTOUT_PF11     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_11)
#define GPIO_EVENTOUT_PF12     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_12)
#define GPIO_EVENTOUT_PF13     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_13)
#define GPIO_EVENTOUT_PF14     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_14)
#define GPIO_EVENTOUT_PF15     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_F|GPIO_CFG_PIN_15)
#define GPIO_EVENTOUT_PG0      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_0)
#define GPIO_EVENTOUT_PG1      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_1)
#define GPIO_EVENTOUT_PG2      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_2)
#define GPIO_EVENTOUT_PG3      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_3)
#define GPIO_EVENTOUT_PG4      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_4)
#define GPIO_EVENTOUT_PG5      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_5)
#define GPIO_EVENTOUT_PG6      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_6)
#define GPIO_EVENTOUT_PG7      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_7)
#define GPIO_EVENTOUT_PG8      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_8)
#define GPIO_EVENTOUT_PG9      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_9)
#define GPIO_EVENTOUT_PG10     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_10)
#define GPIO_EVENTOUT_PG11     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_11)
#define GPIO_EVENTOUT_PG12     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_12)
#define GPIO_EVENTOUT_PG13     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_13)
#define GPIO_EVENTOUT_PG14     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_14)
#define GPIO_EVENTOUT_PG15     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_G|GPIO_CFG_PIN_15)
#define GPIO_EVENTOUT_PH0      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_0)
#define GPIO_EVENTOUT_PH1      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_1)
#define GPIO_EVENTOUT_PH2      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_2)
#define GPIO_EVENTOUT_PH3      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_3)
#define GPIO_EVENTOUT_PH4      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_4)
#define GPIO_EVENTOUT_PH5      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_5)
#define GPIO_EVENTOUT_PH6      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_6)
#define GPIO_EVENTOUT_PH7      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_7)
#define GPIO_EVENTOUT_PH8      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_8)
#define GPIO_EVENTOUT_PH9      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_9)
#define GPIO_EVENTOUT_PH10     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_10)
#define GPIO_EVENTOUT_PH11     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_11)
#define GPIO_EVENTOUT_PH12     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_12)
#define GPIO_EVENTOUT_PH13     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_13)
#define GPIO_EVENTOUT_PH14     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_14)
#define GPIO_EVENTOUT_PH15     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_H|GPIO_CFG_PIN_15)
#define GPIO_EVENTOUT_PJ8      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_J|GPIO_CFG_PIN_8)
#define GPIO_EVENTOUT_PJ9      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_J|GPIO_CFG_PIN_9)
#define GPIO_EVENTOUT_PJ10     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_J|GPIO_CFG_PIN_10)
#define GPIO_EVENTOUT_PJ11     (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_J|GPIO_CFG_PIN_11)
#define GPIO_EVENTOUT_PK0      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_K|GPIO_CFG_PIN_0)
#define GPIO_EVENTOUT_PK1      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_K|GPIO_CFG_PIN_1)
#define GPIO_EVENTOUT_PK2      (GPIO_CFG_MODE_AF|GPIO_CFG_AF_15|GPIO_CFG_PORT_K|GPIO_CFG_PIN_2)

#endif /* __ARCH_ARM_SRC_GD32H7_HARDWARE_GD32H759_PINMAP_H */
